/* automatically generated by rust-bindgen 0.72.1 */

pub type DWORD = ::std::os::raw::c_ulong;
pub type BOOL = ::std::os::raw::c_int;
pub type CHAR = ::std::os::raw::c_char;
pub type LPCSTR = *const CHAR;
pub type HANDLE = *mut ::std::os::raw::c_void;
pub type HRESULT = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HWND__ {
    pub unused: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HWND__"][::std::mem::size_of::<HWND__>() - 4usize];
    ["Alignment of HWND__"][::std::mem::align_of::<HWND__>() - 4usize];
    ["Offset of field: HWND__::unused"][::std::mem::offset_of!(HWND__, unused) - 0usize];
};
pub type HWND = *mut HWND__;
pub type SIMCONNECT_OBJECT_ID = DWORD;
pub const SIMCONNECT_OBJECT_ID_USER: DWORD = 0;
pub const SIMCONNECT_GROUP_PRIORITY_HIGHEST: DWORD = 1;
pub const SIMCONNECT_GROUP_PRIORITY_HIGHEST_MASKABLE: DWORD = 10000000;
pub const SIMCONNECT_GROUP_PRIORITY_STANDARD: DWORD = 1900000000;
pub const SIMCONNECT_GROUP_PRIORITY_DEFAULT: DWORD = 2000000000;
pub const SIMCONNECT_GROUP_PRIORITY_LOWEST: DWORD = 4000000000;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_NULL: SIMCONNECT_RECV_ID = 0;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EXCEPTION: SIMCONNECT_RECV_ID = 1;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_OPEN: SIMCONNECT_RECV_ID = 2;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_QUIT: SIMCONNECT_RECV_ID = 3;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT: SIMCONNECT_RECV_ID = 4;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_OBJECT_ADDREMOVE: SIMCONNECT_RECV_ID = 5;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_FILENAME: SIMCONNECT_RECV_ID = 6;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_FRAME: SIMCONNECT_RECV_ID = 7;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_SIMOBJECT_DATA: SIMCONNECT_RECV_ID = 8;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_SIMOBJECT_DATA_BYTYPE: SIMCONNECT_RECV_ID = 9;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_WEATHER_OBSERVATION: SIMCONNECT_RECV_ID = 10;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_CLOUD_STATE: SIMCONNECT_RECV_ID = 11;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_ASSIGNED_OBJECT_ID: SIMCONNECT_RECV_ID = 12;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_RESERVED_KEY: SIMCONNECT_RECV_ID = 13;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_CUSTOM_ACTION: SIMCONNECT_RECV_ID = 14;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_SYSTEM_STATE: SIMCONNECT_RECV_ID = 15;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_CLIENT_DATA: SIMCONNECT_RECV_ID = 16;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_WEATHER_MODE: SIMCONNECT_RECV_ID = 17;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_AIRPORT_LIST: SIMCONNECT_RECV_ID = 18;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_VOR_LIST: SIMCONNECT_RECV_ID = 19;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_NDB_LIST: SIMCONNECT_RECV_ID = 20;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_WAYPOINT_LIST: SIMCONNECT_RECV_ID = 21;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_MULTIPLAYER_SERVER_STARTED:
    SIMCONNECT_RECV_ID = 22;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_MULTIPLAYER_CLIENT_STARTED:
    SIMCONNECT_RECV_ID = 23;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_MULTIPLAYER_SESSION_ENDED:
    SIMCONNECT_RECV_ID = 24;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_RACE_END: SIMCONNECT_RECV_ID = 25;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_RACE_LAP: SIMCONNECT_RECV_ID = 26;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_EVENT_EX1: SIMCONNECT_RECV_ID = 27;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_FACILITY_DATA: SIMCONNECT_RECV_ID = 28;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_FACILITY_DATA_END: SIMCONNECT_RECV_ID = 29;
pub const SIMCONNECT_RECV_ID_SIMCONNECT_RECV_ID_FACILITY_MINIMAL_LIST: SIMCONNECT_RECV_ID = 30;
pub type SIMCONNECT_RECV_ID = ::std::os::raw::c_int;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_INVALID: SIMCONNECT_DATATYPE = 0;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_INT32: SIMCONNECT_DATATYPE = 1;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_INT64: SIMCONNECT_DATATYPE = 2;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_FLOAT32: SIMCONNECT_DATATYPE = 3;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_FLOAT64: SIMCONNECT_DATATYPE = 4;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_STRING8: SIMCONNECT_DATATYPE = 5;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_STRING32: SIMCONNECT_DATATYPE = 6;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_STRING64: SIMCONNECT_DATATYPE = 7;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_STRING128: SIMCONNECT_DATATYPE = 8;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_STRING256: SIMCONNECT_DATATYPE = 9;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_STRING260: SIMCONNECT_DATATYPE = 10;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_STRINGV: SIMCONNECT_DATATYPE = 11;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_INITPOSITION: SIMCONNECT_DATATYPE = 12;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_MARKERSTATE: SIMCONNECT_DATATYPE = 13;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_WAYPOINT: SIMCONNECT_DATATYPE = 14;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_LATLONALT: SIMCONNECT_DATATYPE = 15;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_XYZ: SIMCONNECT_DATATYPE = 16;
pub const SIMCONNECT_DATATYPE_SIMCONNECT_DATATYPE_MAX: SIMCONNECT_DATATYPE = 17;
pub type SIMCONNECT_DATATYPE = ::std::os::raw::c_int;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_NONE: SIMCONNECT_EXCEPTION = 0;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_ERROR: SIMCONNECT_EXCEPTION = 1;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_SIZE_MISMATCH: SIMCONNECT_EXCEPTION = 2;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_UNRECOGNIZED_ID: SIMCONNECT_EXCEPTION = 3;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_UNOPENED: SIMCONNECT_EXCEPTION = 4;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_VERSION_MISMATCH: SIMCONNECT_EXCEPTION = 5;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_TOO_MANY_GROUPS: SIMCONNECT_EXCEPTION = 6;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_NAME_UNRECOGNIZED: SIMCONNECT_EXCEPTION = 7;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_TOO_MANY_EVENT_NAMES: SIMCONNECT_EXCEPTION = 8;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_EVENT_ID_DUPLICATE: SIMCONNECT_EXCEPTION = 9;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_TOO_MANY_MAPS: SIMCONNECT_EXCEPTION = 10;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_TOO_MANY_OBJECTS: SIMCONNECT_EXCEPTION = 11;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_TOO_MANY_REQUESTS: SIMCONNECT_EXCEPTION = 12;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_WEATHER_INVALID_PORT: SIMCONNECT_EXCEPTION = 13;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_WEATHER_INVALID_METAR: SIMCONNECT_EXCEPTION =
    14;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_WEATHER_UNABLE_TO_GET_OBSERVATION:
    SIMCONNECT_EXCEPTION = 15;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_WEATHER_UNABLE_TO_CREATE_STATION:
    SIMCONNECT_EXCEPTION = 16;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_WEATHER_UNABLE_TO_REMOVE_STATION:
    SIMCONNECT_EXCEPTION = 17;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_INVALID_DATA_TYPE: SIMCONNECT_EXCEPTION = 18;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_INVALID_DATA_SIZE: SIMCONNECT_EXCEPTION = 19;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_DATA_ERROR: SIMCONNECT_EXCEPTION = 20;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_INVALID_ARRAY: SIMCONNECT_EXCEPTION = 21;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_CREATE_OBJECT_FAILED: SIMCONNECT_EXCEPTION = 22;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_LOAD_FLIGHTPLAN_FAILED: SIMCONNECT_EXCEPTION =
    23;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_OPERATION_INVALID_FOR_OBJECT_TYPE:
    SIMCONNECT_EXCEPTION = 24;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_ILLEGAL_OPERATION: SIMCONNECT_EXCEPTION = 25;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_ALREADY_SUBSCRIBED: SIMCONNECT_EXCEPTION = 26;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_INVALID_ENUM: SIMCONNECT_EXCEPTION = 27;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_DEFINITION_ERROR: SIMCONNECT_EXCEPTION = 28;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_DUPLICATE_ID: SIMCONNECT_EXCEPTION = 29;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_DATUM_ID: SIMCONNECT_EXCEPTION = 30;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_OUT_OF_BOUNDS: SIMCONNECT_EXCEPTION = 31;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_ALREADY_CREATED: SIMCONNECT_EXCEPTION = 32;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_OBJECT_OUTSIDE_REALITY_BUBBLE:
    SIMCONNECT_EXCEPTION = 33;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_OBJECT_CONTAINER: SIMCONNECT_EXCEPTION = 34;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_OBJECT_AI: SIMCONNECT_EXCEPTION = 35;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_OBJECT_ATC: SIMCONNECT_EXCEPTION = 36;
pub const SIMCONNECT_EXCEPTION_SIMCONNECT_EXCEPTION_OBJECT_SCHEDULE: SIMCONNECT_EXCEPTION = 37;
pub type SIMCONNECT_EXCEPTION = ::std::os::raw::c_int;
pub const SIMCONNECT_PERIOD_SIMCONNECT_PERIOD_NEVER: SIMCONNECT_PERIOD = 0;
pub const SIMCONNECT_PERIOD_SIMCONNECT_PERIOD_ONCE: SIMCONNECT_PERIOD = 1;
pub const SIMCONNECT_PERIOD_SIMCONNECT_PERIOD_VISUAL_FRAME: SIMCONNECT_PERIOD = 2;
pub const SIMCONNECT_PERIOD_SIMCONNECT_PERIOD_SIM_FRAME: SIMCONNECT_PERIOD = 3;
pub const SIMCONNECT_PERIOD_SIMCONNECT_PERIOD_SECOND: SIMCONNECT_PERIOD = 4;
pub type SIMCONNECT_PERIOD = ::std::os::raw::c_int;
pub const SIMCONNECT_CLIENT_DATA_PERIOD_SIMCONNECT_CLIENT_DATA_PERIOD_NEVER:
    SIMCONNECT_CLIENT_DATA_PERIOD = 0;
pub const SIMCONNECT_CLIENT_DATA_PERIOD_SIMCONNECT_CLIENT_DATA_PERIOD_ONCE:
    SIMCONNECT_CLIENT_DATA_PERIOD = 1;
pub const SIMCONNECT_CLIENT_DATA_PERIOD_SIMCONNECT_CLIENT_DATA_PERIOD_VISUAL_FRAME:
    SIMCONNECT_CLIENT_DATA_PERIOD = 2;
pub const SIMCONNECT_CLIENT_DATA_PERIOD_SIMCONNECT_CLIENT_DATA_PERIOD_ON_SET:
    SIMCONNECT_CLIENT_DATA_PERIOD = 3;
pub const SIMCONNECT_CLIENT_DATA_PERIOD_SIMCONNECT_CLIENT_DATA_PERIOD_SECOND:
    SIMCONNECT_CLIENT_DATA_PERIOD = 4;
pub type SIMCONNECT_CLIENT_DATA_PERIOD = ::std::os::raw::c_int;
pub const SIMCONNECT_FACILITY_LIST_TYPE_SIMCONNECT_FACILITY_LIST_TYPE_AIRPORT:
    SIMCONNECT_FACILITY_LIST_TYPE = 0;
pub const SIMCONNECT_FACILITY_LIST_TYPE_SIMCONNECT_FACILITY_LIST_TYPE_WAYPOINT:
    SIMCONNECT_FACILITY_LIST_TYPE = 1;
pub const SIMCONNECT_FACILITY_LIST_TYPE_SIMCONNECT_FACILITY_LIST_TYPE_NDB:
    SIMCONNECT_FACILITY_LIST_TYPE = 2;
pub const SIMCONNECT_FACILITY_LIST_TYPE_SIMCONNECT_FACILITY_LIST_TYPE_VOR:
    SIMCONNECT_FACILITY_LIST_TYPE = 3;
pub const SIMCONNECT_FACILITY_LIST_TYPE_SIMCONNECT_FACILITY_LIST_TYPE_COUNT:
    SIMCONNECT_FACILITY_LIST_TYPE = 4;
pub type SIMCONNECT_FACILITY_LIST_TYPE = ::std::os::raw::c_int;
pub const SIMCONNECT_RECV_ID_VOR_LIST_HAS_NAV_SIGNAL: DWORD = 1;
pub const SIMCONNECT_RECV_ID_VOR_LIST_HAS_LOCALIZER: DWORD = 2;
pub const SIMCONNECT_RECV_ID_VOR_LIST_HAS_GLIDE_SLOPE: DWORD = 4;
pub const SIMCONNECT_RECV_ID_VOR_LIST_HAS_DME: DWORD = 8;
pub type SIMCONNECT_DATA_REQUEST_FLAG = DWORD;
pub const SIMCONNECT_DATA_REQUEST_FLAG_CHANGED: DWORD = 1;
pub const SIMCONNECT_VIEW_SYSTEM_EVENT_DATA_COCKPIT_2D: DWORD = 1;
pub const SIMCONNECT_VIEW_SYSTEM_EVENT_DATA_COCKPIT_VIRTUAL: DWORD = 2;
pub const SIMCONNECT_VIEW_SYSTEM_EVENT_DATA_ORTHOGONAL: DWORD = 4;
pub const SIMCONNECT_SOUND_SYSTEM_EVENT_DATA_MASTER: DWORD = 1;
pub type SIMCONNECT_NOTIFICATION_GROUP_ID = DWORD;
pub type SIMCONNECT_DATA_DEFINITION_ID = DWORD;
pub type SIMCONNECT_DATA_REQUEST_ID = DWORD;
pub type SIMCONNECT_CLIENT_EVENT_ID = DWORD;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV {
    pub dwSize: DWORD,
    pub dwVersion: DWORD,
    pub dwID: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV"][::std::mem::size_of::<SIMCONNECT_RECV>() - 12usize];
    ["Alignment of SIMCONNECT_RECV"][::std::mem::align_of::<SIMCONNECT_RECV>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV::dwSize"]
        [::std::mem::offset_of!(SIMCONNECT_RECV, dwSize) - 0usize];
    ["Offset of field: SIMCONNECT_RECV::dwVersion"]
        [::std::mem::offset_of!(SIMCONNECT_RECV, dwVersion) - 4usize];
    ["Offset of field: SIMCONNECT_RECV::dwID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV, dwID) - 8usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_EXCEPTION {
    pub _base: SIMCONNECT_RECV,
    pub dwException: DWORD,
    pub dwSendID: DWORD,
    pub dwIndex: DWORD,
}
pub const SIMCONNECT_RECV_EXCEPTION_UNKNOWN_SENDID: DWORD = 0;
pub const SIMCONNECT_RECV_EXCEPTION_UNKNOWN_INDEX: DWORD = 4294967295;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_EXCEPTION"]
        [::std::mem::size_of::<SIMCONNECT_RECV_EXCEPTION>() - 24usize];
    ["Alignment of SIMCONNECT_RECV_EXCEPTION"]
        [::std::mem::align_of::<SIMCONNECT_RECV_EXCEPTION>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_EXCEPTION::dwException"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EXCEPTION, dwException) - 12usize];
    ["Offset of field: SIMCONNECT_RECV_EXCEPTION::dwSendID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EXCEPTION, dwSendID) - 16usize];
    ["Offset of field: SIMCONNECT_RECV_EXCEPTION::dwIndex"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EXCEPTION, dwIndex) - 20usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_OPEN {
    pub _base: SIMCONNECT_RECV,
    pub szApplicationName: [::std::os::raw::c_char; 256usize],
    pub dwApplicationVersionMajor: DWORD,
    pub dwApplicationVersionMinor: DWORD,
    pub dwApplicationBuildMajor: DWORD,
    pub dwApplicationBuildMinor: DWORD,
    pub dwSimConnectVersionMajor: DWORD,
    pub dwSimConnectVersionMinor: DWORD,
    pub dwSimConnectBuildMajor: DWORD,
    pub dwSimConnectBuildMinor: DWORD,
    pub dwReserved1: DWORD,
    pub dwReserved2: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_OPEN"][::std::mem::size_of::<SIMCONNECT_RECV_OPEN>() - 308usize];
    ["Alignment of SIMCONNECT_RECV_OPEN"][::std::mem::align_of::<SIMCONNECT_RECV_OPEN>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::szApplicationName"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, szApplicationName) - 12usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwApplicationVersionMajor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwApplicationVersionMajor) - 268usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwApplicationVersionMinor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwApplicationVersionMinor) - 272usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwApplicationBuildMajor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwApplicationBuildMajor) - 276usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwApplicationBuildMinor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwApplicationBuildMinor) - 280usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwSimConnectVersionMajor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwSimConnectVersionMajor) - 284usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwSimConnectVersionMinor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwSimConnectVersionMinor) - 288usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwSimConnectBuildMajor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwSimConnectBuildMajor) - 292usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwSimConnectBuildMinor"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwSimConnectBuildMinor) - 296usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwReserved1"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwReserved1) - 300usize];
    ["Offset of field: SIMCONNECT_RECV_OPEN::dwReserved2"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_OPEN, dwReserved2) - 304usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_EVENT {
    pub _base: SIMCONNECT_RECV,
    pub uGroupID: DWORD,
    pub uEventID: DWORD,
    pub dwData: DWORD,
}
pub const SIMCONNECT_RECV_EVENT_UNKNOWN_GROUP: DWORD = 4294967295;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_EVENT"][::std::mem::size_of::<SIMCONNECT_RECV_EVENT>() - 24usize];
    ["Alignment of SIMCONNECT_RECV_EVENT"]
        [::std::mem::align_of::<SIMCONNECT_RECV_EVENT>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_EVENT::uGroupID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EVENT, uGroupID) - 12usize];
    ["Offset of field: SIMCONNECT_RECV_EVENT::uEventID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EVENT, uEventID) - 16usize];
    ["Offset of field: SIMCONNECT_RECV_EVENT::dwData"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EVENT, dwData) - 20usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_EVENT_FILENAME {
    pub _base: SIMCONNECT_RECV_EVENT,
    pub szFileName: [::std::os::raw::c_char; 260usize],
    pub dwFlags: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_EVENT_FILENAME"]
        [::std::mem::size_of::<SIMCONNECT_RECV_EVENT_FILENAME>() - 288usize];
    ["Alignment of SIMCONNECT_RECV_EVENT_FILENAME"]
        [::std::mem::align_of::<SIMCONNECT_RECV_EVENT_FILENAME>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_EVENT_FILENAME::szFileName"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EVENT_FILENAME, szFileName) - 24usize];
    ["Offset of field: SIMCONNECT_RECV_EVENT_FILENAME::dwFlags"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EVENT_FILENAME, dwFlags) - 284usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_EVENT_FRAME {
    pub _base: SIMCONNECT_RECV_EVENT,
    pub fFrameRate: f32,
    pub fSimSpeed: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_EVENT_FRAME"]
        [::std::mem::size_of::<SIMCONNECT_RECV_EVENT_FRAME>() - 32usize];
    ["Alignment of SIMCONNECT_RECV_EVENT_FRAME"]
        [::std::mem::align_of::<SIMCONNECT_RECV_EVENT_FRAME>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_EVENT_FRAME::fFrameRate"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EVENT_FRAME, fFrameRate) - 24usize];
    ["Offset of field: SIMCONNECT_RECV_EVENT_FRAME::fSimSpeed"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_EVENT_FRAME, fSimSpeed) - 28usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_SIMOBJECT_DATA {
    pub _base: SIMCONNECT_RECV,
    pub dwRequestID: DWORD,
    pub dwObjectID: DWORD,
    pub dwDefineID: DWORD,
    pub dwFlags: DWORD,
    pub dwentrynumber: DWORD,
    pub dwoutof: DWORD,
    pub dwDefineCount: DWORD,
    pub dwData: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_SIMOBJECT_DATA"]
        [::std::mem::size_of::<SIMCONNECT_RECV_SIMOBJECT_DATA>() - 44usize];
    ["Alignment of SIMCONNECT_RECV_SIMOBJECT_DATA"]
        [::std::mem::align_of::<SIMCONNECT_RECV_SIMOBJECT_DATA>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwRequestID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwRequestID) - 12usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwObjectID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwObjectID) - 16usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwDefineID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwDefineID) - 20usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwFlags"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwFlags) - 24usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwentrynumber"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwentrynumber) - 28usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwoutof"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwoutof) - 32usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwDefineCount"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwDefineCount) - 36usize];
    ["Offset of field: SIMCONNECT_RECV_SIMOBJECT_DATA::dwData"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_SIMOBJECT_DATA, dwData) - 40usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_FACILITIES_LIST {
    pub _base: SIMCONNECT_RECV,
    pub dwRequestID: DWORD,
    pub dwArraySize: DWORD,
    pub dwEntryNumber: DWORD,
    pub dwOutOf: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_FACILITIES_LIST"]
        [::std::mem::size_of::<SIMCONNECT_RECV_FACILITIES_LIST>() - 28usize];
    ["Alignment of SIMCONNECT_RECV_FACILITIES_LIST"]
        [::std::mem::align_of::<SIMCONNECT_RECV_FACILITIES_LIST>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_FACILITIES_LIST::dwRequestID"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_FACILITIES_LIST, dwRequestID) - 12usize];
    ["Offset of field: SIMCONNECT_RECV_FACILITIES_LIST::dwArraySize"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_FACILITIES_LIST, dwArraySize) - 16usize];
    ["Offset of field: SIMCONNECT_RECV_FACILITIES_LIST::dwEntryNumber"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_FACILITIES_LIST, dwEntryNumber) - 20usize];
    ["Offset of field: SIMCONNECT_RECV_FACILITIES_LIST::dwOutOf"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_FACILITIES_LIST, dwOutOf) - 24usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_DATA_FACILITY_AIRPORT {
    pub Icao: [::std::os::raw::c_char; 9usize],
    pub Latitude: f64,
    pub Longitude: f64,
    pub Altitude: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_DATA_FACILITY_AIRPORT"]
        [::std::mem::size_of::<SIMCONNECT_DATA_FACILITY_AIRPORT>() - 33usize];
    ["Alignment of SIMCONNECT_DATA_FACILITY_AIRPORT"]
        [::std::mem::align_of::<SIMCONNECT_DATA_FACILITY_AIRPORT>() - 1usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_AIRPORT::Icao"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_AIRPORT, Icao) - 0usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_AIRPORT::Latitude"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_AIRPORT, Latitude) - 9usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_AIRPORT::Longitude"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_AIRPORT, Longitude) - 17usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_AIRPORT::Altitude"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_AIRPORT, Altitude) - 25usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_AIRPORT_LIST {
    pub _base: SIMCONNECT_RECV_FACILITIES_LIST,
    pub rgData: [SIMCONNECT_DATA_FACILITY_AIRPORT; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_AIRPORT_LIST"]
        [::std::mem::size_of::<SIMCONNECT_RECV_AIRPORT_LIST>() - 61usize];
    ["Alignment of SIMCONNECT_RECV_AIRPORT_LIST"]
        [::std::mem::align_of::<SIMCONNECT_RECV_AIRPORT_LIST>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_AIRPORT_LIST::rgData"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_AIRPORT_LIST, rgData) - 28usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_DATA_FACILITY_WAYPOINT {
    pub _base: SIMCONNECT_DATA_FACILITY_AIRPORT,
    pub fMagVar: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_DATA_FACILITY_WAYPOINT"]
        [::std::mem::size_of::<SIMCONNECT_DATA_FACILITY_WAYPOINT>() - 37usize];
    ["Alignment of SIMCONNECT_DATA_FACILITY_WAYPOINT"]
        [::std::mem::align_of::<SIMCONNECT_DATA_FACILITY_WAYPOINT>() - 1usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_WAYPOINT::fMagVar"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_WAYPOINT, fMagVar) - 33usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_WAYPOINT_LIST {
    pub _base: SIMCONNECT_RECV_FACILITIES_LIST,
    pub rgData: [SIMCONNECT_DATA_FACILITY_WAYPOINT; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_WAYPOINT_LIST"]
        [::std::mem::size_of::<SIMCONNECT_RECV_WAYPOINT_LIST>() - 65usize];
    ["Alignment of SIMCONNECT_RECV_WAYPOINT_LIST"]
        [::std::mem::align_of::<SIMCONNECT_RECV_WAYPOINT_LIST>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_WAYPOINT_LIST::rgData"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_WAYPOINT_LIST, rgData) - 28usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_DATA_FACILITY_NDB {
    pub _base: SIMCONNECT_DATA_FACILITY_WAYPOINT,
    pub fFrequency: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_DATA_FACILITY_NDB"]
        [::std::mem::size_of::<SIMCONNECT_DATA_FACILITY_NDB>() - 41usize];
    ["Alignment of SIMCONNECT_DATA_FACILITY_NDB"]
        [::std::mem::align_of::<SIMCONNECT_DATA_FACILITY_NDB>() - 1usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_NDB::fFrequency"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_NDB, fFrequency) - 37usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_NDB_LIST {
    pub _base: SIMCONNECT_RECV_FACILITIES_LIST,
    pub rgData: [SIMCONNECT_DATA_FACILITY_NDB; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_NDB_LIST"]
        [::std::mem::size_of::<SIMCONNECT_RECV_NDB_LIST>() - 69usize];
    ["Alignment of SIMCONNECT_RECV_NDB_LIST"]
        [::std::mem::align_of::<SIMCONNECT_RECV_NDB_LIST>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_NDB_LIST::rgData"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_NDB_LIST, rgData) - 28usize];
};
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_DATA_FACILITY_VOR {
    pub _base: SIMCONNECT_DATA_FACILITY_NDB,
    pub Flags: DWORD,
    pub fLocalizer: f32,
    pub GlideLat: f64,
    pub GlideLon: f64,
    pub GlideAlt: f64,
    pub fGlideSlopeAngle: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_DATA_FACILITY_VOR"]
        [::std::mem::size_of::<SIMCONNECT_DATA_FACILITY_VOR>() - 77usize];
    ["Alignment of SIMCONNECT_DATA_FACILITY_VOR"]
        [::std::mem::align_of::<SIMCONNECT_DATA_FACILITY_VOR>() - 1usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_VOR::Flags"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_VOR, Flags) - 41usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_VOR::fLocalizer"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_VOR, fLocalizer) - 45usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_VOR::GlideLat"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_VOR, GlideLat) - 49usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_VOR::GlideLon"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_VOR, GlideLon) - 57usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_VOR::GlideAlt"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_VOR, GlideAlt) - 65usize];
    ["Offset of field: SIMCONNECT_DATA_FACILITY_VOR::fGlideSlopeAngle"]
        [::std::mem::offset_of!(SIMCONNECT_DATA_FACILITY_VOR, fGlideSlopeAngle) - 73usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SIMCONNECT_RECV_VOR_LIST {
    pub _base: SIMCONNECT_RECV_FACILITIES_LIST,
    pub rgData: [SIMCONNECT_DATA_FACILITY_VOR; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SIMCONNECT_RECV_VOR_LIST"]
        [::std::mem::size_of::<SIMCONNECT_RECV_VOR_LIST>() - 105usize];
    ["Alignment of SIMCONNECT_RECV_VOR_LIST"]
        [::std::mem::align_of::<SIMCONNECT_RECV_VOR_LIST>() - 1usize];
    ["Offset of field: SIMCONNECT_RECV_VOR_LIST::rgData"]
        [::std::mem::offset_of!(SIMCONNECT_RECV_VOR_LIST, rgData) - 28usize];
};
pub type DispatchProc = ::std::option::Option<
    unsafe extern "C" fn(
        pData: *mut SIMCONNECT_RECV,
        cbData: DWORD,
        pContext: *mut ::std::os::raw::c_void,
    ),
>;
unsafe extern "C" {
    pub fn SimConnect_MapClientEventToSimEvent(
        hSimConnect: HANDLE,
        EventID: SIMCONNECT_CLIENT_EVENT_ID,
        EventName: *const ::std::os::raw::c_char,
    ) -> HRESULT;
}
unsafe extern "C" {
    pub fn SimConnect_AddClientEventToNotificationGroup(
        hSimConnect: HANDLE,
        GroupID: SIMCONNECT_NOTIFICATION_GROUP_ID,
        EventID: SIMCONNECT_CLIENT_EVENT_ID,
        bMaskable: BOOL,
    ) -> HRESULT;
}
unsafe extern "C" {
    pub fn SimConnect_RemoveClientEvent(
        hSimConnect: HANDLE,
        GroupID: SIMCONNECT_NOTIFICATION_GROUP_ID,
        EventID: SIMCONNECT_CLIENT_EVENT_ID,
    ) -> HRESULT;
}
